{
    "name": "THORCHAIN",
    "website":"https://thorchain.org/",
    "twitter": "https://twitter.com/thorchain_org",
    "telegram": "https://t.me/thorchain_org",
    "medium": "https://medium.com/thorchain",
    "github": "https://github.com/thorchain",
    "whitepaper": "https://github.com/DecentralCardGame/whitepaper/blob/master/whitepaper.pdf",
    "proof": [ 
        "https://github.com/thorchain/thorchain-wasm-bridge",
        "https://github.com/thorchain/Resources/blob/master/Whitepapers/THORChain/whitepaper-en.md#consensus"
    ],
    "description": "THE LIGHTNING FAST DECENTRALISED EXCHANGE PROTOCOL",
    "description_long": [
        "THORChain is a highly optimised multi-chain using pBFT consensus to achieve sub-second block finality. Tokens are traded on single chains, known as tokenChains with discrete address spaces. Multi-set sharding is proposed to allow byzantine resistant scaling. The native protocol facilitates on-chain trading and order matching at the protocol level, supporting both limit and market orders. Continuous liquidity pools ensure liquidity is always available for any token pair, and double as the source of trustless on-chain price feeds, a cornerstone of the protocol. Fee incentives are designed to continually attract on-chain liquidity. On-chain token generation is built-in for both fixed and variable supply tokens, with the potential for auditable collateralized stablecoins. Two-way pegs with UTXO, account and contract-based cryptocurrencies allow most existing cryptocurrencies to seamlessly move on and off THORChain. Transparent developer incentivisation strategies allow wallet and exchange developers to be funded at the protocol level which will encourage a vibrant developer community. On-chain governance and smart updates with enforced voting and quadratic voting ensures THORChain is an adaptive and iterative platform that grows with its needs without contentious hard forks. THORChain is built to be compatible with the Flash Network; a layer 2 payment channel network."
    ]
}